Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 02-The-Little-Red-Hen/CAT/red-hen/tm/jitaga-usdi.en.utf8.tmx
Source language: en
Languages: chr

source: This is Chicken Little.
chr: ᎯᎠ ᏥᏔᎦ ᎤᏍᏗ.

source: Chicken Little is a girl.
chr: ᏥᏔᎦ ᎤᏍᏗ ᎠᎩᏏ.

source: Chicken Little was wandering about in the woods.
chr: ᏥᏔᎦ ᎤᏍᏗ ᎢᎾᎨᎢ ᎤᏪᏙᎴ.

source: An acorn fell.
chr: ᎫᎴ ᎤᏬᎰᏎ.

source: It fell on top of her head.
chr: ᎠᏍᎪᎵ ᎦᏚ ᎤᏬᎰᏎ.

source: She did not see the acorn.
chr: Ꮭ ᎫᎴ ᏳᎪᎮ.

source: "What was that?" she said.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ.

source: "Dear me, what was that?"
chr: “Ꭷ, ᎦᏙ ᎤᏍᏗ?”

source: "What was that, O sun?" said Chicken Little.
chr: “Ꭷ ᏅᏓ, ᎦᏙ ᎤᏍᏗ?”

source: "What was that, O wind?" said Chicken Little.
chr: “Ꭷ ᎤᏃᎴ, ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "What was that, O tree?" said Chicken Little.
chr: “Ꭷ ᏡᎬ, ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "Look and see," said the sun.
chr: “ᎯᏲᎦ ᎠᎴ ᎯᎪᏩᏔ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "Look and see," said the wind.
chr: “ᎯᏲᎦ ᎠᎴ ᎯᎪᏩᏔ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "Look and see," said the tree.
chr: “ᎯᏲᎦ ᎠᎴ ᎯᎪᏩᏔ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "I do not see," said Chicken Little.
chr: “ᎥᏝ ᏱᏥᎪᏩᏘᎭ,” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "What was it?"
chr: “ᎦᏙ ᎤᏍᏗ?”

source: Chicken Little did not see what it was.
chr: Ꮭ ᏥᏔᎦ ᎤᏍᏗ ᎪᎱᏍᏗ ᏳᎪᎮ.

source: "What was it?" she said.
chr: “ᎦᏙ ᎤᏍᏗ ᎨᏎ?” ᏄᏪᏎ.

source: "What was it?
chr: “ᎦᏙ ᎤᏍᏗ ᎨᏎ?

source: Tell me, wind.
chr: Ꭷ ᎤᏃᎴ, ᏍᎩᏃᎲᎳ.

source: Tell me, sun.
chr: Ꭷ ᏅᏓ, ᏍᎩᏃᎲᎳ.

source: Tell me, tree.
chr: Ꭷ ᏡᎬ, ᏍᎩᏃᎲᎳ.

source: Tell me what it was."
chr: ᎢᏍᎩᏃᎲᎳ Ꮎ ᎪᎱᏍᏗ ᎨᏎ.”

source: Then the wind laughed.
chr: ᎾᎯᏳ ᎤᏃᎴ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: And the sun laughed.
chr: ᏅᏓᏃ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: And the tree laughed.
chr: ᏡᎬᏃ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: "It was the sky," said the wind.
chr: “ᎦᎸᎳᎶ ᎨᏎ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "It was the sky," said the sun.
chr: “ᎦᎸᎳᎶ ᎨᏎ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "It was the sky," said the tree.
chr: “ᎦᎸᎳᎶ ᎨᏎ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "The sky is falling," said the wind.
chr: “ᎦᎸᎳᎶ ᎪᎰᏍᎦ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "The sky is falling," said the sun.
chr: “ᎦᎸᎳᎶ ᎪᎰᏍᎦ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "The sky is falling," said the tree.
chr: “ᎦᎸᎳᎶ ᎪᎰᏍᎦ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "O dear! O dear!" said Chicken Little.
chr: “Ꭳ ᎯᎠ ᎤᏲ! Ꭳ ᎯᎠ ᎤᏲ!” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "I will go and tell the king."
chr: “ᎤᎬᏫᏳᎯ ᏓᏥᏃᎮᏢᏏ.”

source: So off flew Chicken Little to tell the king.
chr: ᎠᎴ ᎤᎬᏫᏳᎯ ᎤᏃᎮᏗ ᎤᏝᏫᏛᎮ ᏥᏔᎦ ᎤᏍᏗ.”

source: She ran and she ran.
chr: ᎠᏟᏎ ᎠᎴ ᎠᏟᏎ.

source: She flew and she flew.
chr: ᎦᏃᎯᎵᏎ ᎠᎴ ᎦᏃᎯᎵᏎ.

source: Dear me," said she.
chr: ᎯᎠ ᎤᏲ,” ᏄᏪᏎ.

source: "I will go to the king.
chr: “ᎤᎬᏫᏳᎯ ᏓᎨᏅᏏ.

source: I will go to the king.
chr: ᎤᎬᏫᏳᎯ ᏓᎨᏅᏏ.

source: I will tell him what the wind said.
chr: ᎤᏃᎴ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏟ.

source: I will tell him what the sun said.
chr: ᏅᏓ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏟ.

source: I will tell him what the tree said.
chr: ᏡᎬ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏟ.

source: The wind said that the sky is falling.
chr: ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ Ꮎ ᎦᎸᎳᎶ ᎪᎰᏍᎦ.

source: The sun said that the sky is falling.
chr: ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ Ꮎ ᎦᎸᎳᎶ ᎪᎰᏍᎦ.

source: The tree said that the sky is falling.
chr: ᏡᎬ ᎠᏗᏍᎩ ᎨᎡ Ꮎ ᎦᎸᎳᎶ ᎪᎰᏍᎦ.

source: I will tell the king."
chr: ᎤᎬᏫᏳᎯ ᏓᏥᏃᎮᏟ.”

source: On the way Chicken Little met a female chicken.
chr: ᎾᎯᏳ ᏥᏔᎦ ᎤᏍᏗ ᎠᎴ ᏥᏔᎦ ᎠᎩᏏ ᏓᎾᏠᏎ.

source: "Henny Penny" is the female chicken's name.
chr: “ᏏᎩᏏ ᎠᎩᏏ” ᏚᏙᎥ ᏥᏔᎦ ᎠᎩᏏ.

source: "Where are you going, Chicken Little?" said Henny Penny.
chr: “ᎭᏢ ᎡᎦ, ᏥᏔᎦ ᎤᏍᏗ?” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Where am I going?
chr: “ᎭᏢ ᎨᎦ?

source: Why, why, why!
chr: ᎦᏙ, ᎦᏙ, ᎦᏙ!

source: The sky is falling.
chr: ᎦᎸᎶ ᎪᎰᏍᎦ.

source: I go to tell the king."
chr: ᎤᎬᏫᏳᎯ ᏥᏃᎮᏞᎴᎦ.

source: "Why, why, why!" said Henny Penny.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Who told you so?"
chr: “ᎦᎪ ᏣᏃᎮᏞᎴ?”

source: "The wind told me.
chr: “ᎤᏃᎴ ᎠᎩᏃᎮᏞᎴ.

source: And the sun told me.
chr: ᏅᏓᏃ ᎠᎩᏃᎮᏞᎴ.

source: And the tree told me.
chr: ᏡᎬᏃ ᎠᎩᏃᎮᏞᎴ.

source: Why, why, why!"
chr: ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: "I will go with you, if I may," said Henny Penny.
chr: “ᎢᎾᎵᎪᏅᎭ ᎠᎴ ᎢᏁᏅᏒᎭ,”

source: "I will go with you to tell the king.
chr: “ᎤᎬᏫᏳᎯ ᏓᏂᏃᎮᏞᎸᏏ.

source: And away the two ran.
chr: ᎠᎴ Ꮎ ᎠᏂᏔᎵ ᎤᎾᎵᏘᏎ.

source: On the way they met a male chicken.
chr: ᎾᎯᏳ Ꮎ ᎠᏂᏔᎵ ᎠᎴ ᏥᏔᎦ ᎠᏨᏯ ᏓᎾᏠᏎ.

source: "Cocky Locky" was his name.
chr: “ᏨᏨᏯ ᎠᏨᏯ” ᏚᏙᎥ ᏥᏔᎦ ᎠᏨᏯ.

source: "Where are you going, Chicken Little?
chr: “ᎭᏢ ᎮᎪ, ᏥᏔᎦ ᎤᏍᏗ?

source: Where are you going, Henny Penny?" said Cocky Locky.
chr: ᎭᏢ ᎮᎪ, ᏏᎩᏏ ᎠᎩᏏ?” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "Where are we going?
chr: “ᎭᏢ ᎣᏍᏕᎦ?

source: We go to tell the king."
chr: ᎤᎬᏫᏳᎯ ᎣᏍᏗᏃᎮᏞᎴᎦ.”

source: "Why, why, why!" said Cocky Locky.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "The wind told us.
chr: “ᎤᏃᎴ ᎣᎩᏂᏃᏞᎸ.

source: And the sun told us.
chr: ᏅᏓᏃ ᎣᎩᏂᏃᏞᎸ.

source: And the tree told us.
chr: ᏡᎬᏃ ᎣᎩᏂᏃᏞᎸ.

source: "I will go with you, if I may," said Cocky Locky.
chr: “ᏕᏓᏠᏒᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: " Why, why, why ! "
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: And away the three ran.
chr: ᎠᎴ Ꮎ ᎠᏂᏦᎢ ᎤᎾᎵᏘᏎ.

source: Then those four met a goose.
chr: ᎾᎯᏳ Ꮎ ᏅᎩ ᎠᎴ ᏌᏌ ᏓᎾᏠᏎ.

source: Goosey Loosey was its name.
chr: “ᏏᏏ ᏌᏌ” ᏚᏙᎥ ᎧᏬᏄ.

source: We go to tell the king.
chr: ᎤᎬᏫᏳᎯ ᎣᏥᏃᎮᏞᎴᎦ.

source: We go to tell the king that the sky is falling."
chr: ᎦᎸᎶ ᎪᎰᏍᎦ ᎤᎬᏫᏳᎯ ᎯᎠ ᎣᏥᏃᎮᏞᎴᎦ.”

source: "Why, why, why!" said Goosey Loosey.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "I will go with you, if I may," said Goosey Loosey.
chr: “ᏕᏓᎾᏠᏒᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "Why, why, why!"
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: And away the five ran.
chr: ᎠᎴ Ꮎ ᎯᏍᎩ ᎤᎾᎵᏘᏎ.

source: On the way they met a turkey.
chr: ᎾᎯᏳ Ꮎ ᎯᏍᎩ ᎠᎴ ᎬᎾ ᏓᎾᏠᏎ.

source: Turkey Lurkey was its name.
chr: “ᎬᏌ ᎬᎾ” ᏚᏙᎥ ᎬᎾ.

source: Where are you going, Henny Penny?
chr: ᎭᏢ ᎮᎦ, ᏏᎩᏏ ᎠᎩᏏ?

source: Where are you going, Cocky Locky ?
chr: ᎭᏢ ᎮᎦ ᏨᏨᏯ ᎠᏨᏯ?

source: Where are you going, Ducky Lucky?
chr: ᎭᏢ ᎮᎦ ᏌᏬᏄ ᎧᏬᏄ?

source: Where are you going, Goosey Loosey?
chr: ᎭᏢ ᎮᎦ ᏏᏏ ᏌᏌ?

source: Where are you going?" said Turkey Lurkey.
chr: ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᎬᏌ ᎬᎾ.

source: Then those six and a hungry fox met.
chr: ᎾᎯᏳ Ꮎ ᏑᏓᎵ ᎠᎴ ᎤᏲᏏᏍᎬᎢ ᏧᏟ ᏓᎾᏠᏎ.

source: “Fox fox” was his name.
chr: “ᏧᎳ ᏧᏟ” ᏚᏙᎥ ᏧᏟ.

source: “Where are you going?” said Foxy Loxy.
chr: “ᎭᏢ ᎢᏤᎦ?” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: "Why, why, why!" said Foxy Loxy.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: And the tree told us."
chr: ᏡᎬᏃ ᎣᎩᏃᎮᏞᎸ.

source: "I will go with you, if I may," said Foxy Loxy.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: And away the seven ran.
chr: ᎠᎴ Ꮎ ᎦᎵᏉᎩ ᎤᎾᎵᏘᏎ.

source: "Come with me," said the fox.
chr: “ᎢᏓᎵᎪᎲᎦ ᎠᎴ ᎢᏕᎾ,” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: "I will show you the way."
chr: “ᏄᏍᏗ ᏓᏨᎪᏩᏛᏔᏂ.”

source: "Yes," said Chicken Little.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "Yes," said Henny Penny.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Yes," said Cocky Locky.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "Yes," said Ducky Lucky.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏌᏬᏄ ᎧᏬᏄ.

source: "Yes," said Goosey Loosey.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "Yes," said Turkey Lurkey.
chr: “ᎥᎥ,” ᏄᏪᏎ ᎬᏌ ᎬᎾ.

source: "We will go with you.
chr: “ᏓᏓᎵᎪᏂ ᎠᎴ ᏓᏕᏅᏏ.

source: Show us the way."
chr: ᏄᏍᏗ ᎢᏍᎩᎪᏩᏛᏓ.”

source: So Foxy Loxy led Chicken Little, Henny Penny, Cocky Locky, Ducky Lucky, Groosey Loosey and Turkey Lurkey into the woods.
chr: ᏃᎴ ᏧᎳ ᏧᏟ ᎥᏍᎩᎾ ᏚᏘᏅᏎ ᎢᎾᎨᎢ ᎠᏰᎵ, ᏥᏔᎦ ᎤᏍᏗ, ᏏᎩᏏ ᎠᎩᏏ, ᏨᏨᏯ ᎠᏨᏯ, ᏌᏬᏄ ᎧᏬᏄ, ᏏᏏ ᏌᏌ, ᎠᎴ ᎬᏌ ᎬᎾ.

source: Foxy Loxy had a cave in the woods.
chr: ᏧᎳ ᏧᎵ ᎤᏤᎵ ᎤᏍᏓᎦᎸᎢ ᎢᎾᎨᎢ ᎠᏰᎵ.

source: The cave was his home.
chr: Ꮎ ᎤᏍᏓᎦᎸ ᏧᏪᏅᏒᎢ.

source: So he led Chicken Little and her friends to the cave.
chr: ᎤᏍᏓᎦᎸᎢ ᏚᏘᏅᏎ, ᏥᏔᎦ ᎤᏍᏗ ᎠᎴ ᏧᎾᎵ.

source: "O! O! O!" they cried.
chr: “Ꭳ! Ꭳ! Ꭳ!” ᏍᏓᏯ ᏄᏂᏪᏎ.

source: "Where is the king?"
chr: “ᎭᏢ ᎤᎬᏫᏳᎯ?”

source: The hungry fox laughed.
chr: Ꮎ ᎤᏲᏏᎬᎢ ᏧᏟ ᎤᏰᏘᏎ.

source: Alas, poor silly Chicken Little!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏥᏔᎦ ᎤᏍᏗ!

source: Alas, poor silly Henny Penny!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏏᎩᏏ ᎠᎩᏏ!

source: Alas, poor silly Cocky Locky!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏨᏨᏯ ᎠᏨᏯ!

source: Alas, poor silly Ducky Lucky!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏌᏬᏄ ᎧᏬᏄ!

source: Alas, poor silly Goosey Loosey!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏏᏏ ᏌᏌ!

source: Alas, poor silly Turkey Lurkey!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᎬᏌ ᎬᎾ!

source: And the bad fox laughed and laughed.
chr: ᎠᎴ ᎤᏲᎢ ᏧᏟ ᎤᏰᏘᏏᎶᎡ.
